import React, {Component} from "react";
import ProjectInfoBlock from "./ProjectInfoBlock";

const text = {
  description1: 'СПИСОК ЗАВДАНЬ Ставте завдання. Слідкуйте за звичками. З додатком WhipCake ви будете результативніше. Застрягли? Лінь? Є способи вас простимулювати!ПІДТРИМКА УЧАСНИКІВПоручителі і Ментори візьмуться за вас і не відпустять, поки завдання не буде виконано. Станьте Поручителями і допомагайте іншим. Знайдіть свого Ментора.НАГОРОДИ І БОНУСИ. Спеціально розроблена система досягнень Whipcake батогом і пряником змусить вас стати успішніше, продуктивніше і сильніше. Вступайте в альянс!',
  description2: 'Добрый день! Я работаю над высоко тиражируемым, многофункциональным, мультиязычным проектом Платформа для работы малого и среднего бизнеса . Цель: построение разноуровневого, авторизированного и личного взаимоотношения между покупателем и продавцом. Я предприниматель и имею неоднократный опыт создания и развития предприятия в разных сферах бизнеса. При любом бизнесе неотъемлимой его частью является онлайн презентация компании. Здесь и начинаются проблемы -затраты времени на поиск того кто сделает саит, как сделает, за сколько сделает, плюс трата времени, потом поддержка и, если необходимо, онлайн продвижение, а это дополнительные затраты и потеря времени. У меня родилась идея как сделать удобное и необходимое для бизнеса и покупателя ценное предложение, основываясь также на своем опыте. Я сделал опрос 30 клиентов: Продавцов и Покупателей, и они тоже столкнулись точно с такой же проблемой. Я продумал проект состоящий из 12 частей, разбитых по стратегическим этапам выхода на рынок и развитию. Первые 4 части сделаны в мобильной и десктопной версии. Сделана презентация готового дизайна 20 потенциальным покупателям и получил 100 % положительных ответов на ценность, выявления проблемы и  покупку услуги. Презентацию проекта и его обсуждение делал господину  Lowrence Wright (основатель и соучередитель Launch Gurus). Получил положительную оценку и консультацию по направлению способа развития. На данный момент есть бизнес модель проекта, черновой вариант "способы знакомства с аудиторией", котроый надо доработать по стратегии и рациональности развития. Кликабельный дизайн 4х частей, которым надо частично сделать редизайн и доработать несколько страниц, остальные части надо разрабатывать. Готовится черновой бизнес план. Куплены два имени для проекта:  navigator.life и короткое navi.life В команду нужны : Дизайнер UI/UX, Верстальщик, Менджер проекта, PR Менеджер, Менеджер по продаже рекламы, Маркетинг менеджер, SEO специалист, Контент продюсер,. Программисты PHP MySQL, Тестировщик. Если вы инициативны самостоятельны ,способны планировать и организовывать свое рабочее время. Вы четко видите цели и этапы их достижения. У вас успешный опыт в своей сфере. Вас не пугают трудности в работе. Вы способны находить достойные решения в конфликтных ситуациях. Если это Вы у Вас есть возможность встать у истоков создания одной из ведущих компаний мира . Сделать карьерный рост на мировом рынке. Просьба обращения подкреплять CV и Портфолио. Зарание благодарен за внимание. e-mail: antli.progres@gmail.com skype:antli.progres',
  description3: "Всім привіт! Думаю, багато хто чув про починання як великих гігантів на кшталт Google, Amazon, DHL, так і невеликих компаній в сфері комерційної доставки дронамі на ринку B2C. І у всіх в цілому є успіхи в цій галузі, хоча і ті й інші вперлися в законодавство, яке правиться зі скрипом і здебільшого через неможливість контролю за дронамі.Наш же проект дозволить вивести комерційну доставку дронамі на новий рівень. Як це буде досягнуто?1. Інша концепція логістики реалізується через спеціальне програмне забезпечення.2. Використання непоширених технологічних рішень у виробництві дронів.Реалізація проекту буде складатися з двох етапів:1. Розробка програмного забезпечення і його випробування. 2. Розробка додаткової інфраструктури і створення кур'єрської служби БПЛА в Санкт-Петербурзі. На даний момент вже є: - сама ідея, постійно доопрацьовувана; - концепція всієї системи і набір використовуваних для неї технологій; - підтримка центру комерціалізації наукових розробок і венчурного фінансування інноваційного бізнесу Тверського державного університету; - домовленість з компанією, що займається безпосередньо проектуванням і виробництвом БПЛА комерційної спрямованості.",
  description4: 'Robo law- составит документы, подаст в суд и выграет дело. ищу програмиста в команду, проект раделен на части 1) самые шаблонные дела 2) дела с нескольким вариантом исхода на данный момент нужно риализовать 1 часть пректа',
  description5: 'Проект являє собою автоматизований сервіс телемаркетингу. Сервіс вирішує проблеми компаній і виконавців. Будь-яка компанія, за кілька хвилин може створити новий проект в сервісі і запустити телемаркетинг (дзвінки). Через кілька годин отримуючи перші результати. Виконавцями є будь-які фахівці які зареєструвалися в сервісі як "Спеціаліст". За кожен дзвінок у компанії (замовника) списуються кошти і нараховуються фахівця (виконавцю), серівіс утримує свій відсоток. Серівс вирішує окремо виділену проблему. Даний момент проект на стадії ідеї. Необхідні розробники для створення прототипу. Розробники будуть зараховані до списку засновників серівса, закріплений% від сервісу і будуть виплачені гроші за витрачений час на розробку, з першого раунду інвестицій.',
  description6: 'Peer-to-peer гео социальная сеть. Пользователь регистрируется, заполняет свой профиль, выбирает тэги (короткие слова), которые характеризуют его, выбирает тэги которые его интересуют(например "знакомства", "девушка", "студент"). На основном экране - карте, появляются те люди у которых характеризующие их тэги соответствуют тэгам, которые интересуют пользователя. Пользователь в реальном времени видит кто вокруг него, их перемещение, может начать чат с понравившемся пользователем. Также пользователь может создать видеотрансляцию, которая работает по технологии p2p, аналогично с Periscope(tm). Фишка проекта в том что серверная часть задействована только для координации пользователей друг с другом, всё основное же происходит на стороне клиента, с помощью WebRTC. Проект работает, но нуждается в полноценном тестировании, доработке и переработке. Приоритетом  сейчас является перевод клиентской части на React + mobx, чтобы ускорить внедрение новых интересных "фич" - например, поиск работы по аналогии с youdo, вызов такси по аналогии с uber. В команде сейчас я один, так как среди знакомых нет людей с нужными навыками и квалификацией. Microsoft одобрил bizpack, так что имеются лицензии для разработки на 5 человек + azure на год',
};

class ProjectList extends Component{
    render(){
        return(
            <div className="projectList">
                <ProjectInfoBlock
                    projectName="Whipcake.com - список задач, мотивирующий действовать"
                    projectDescript={text.description1}
                    projectType="Проект"
                    need="Front-end інженер"
                    authName="Михайло Грушевський"
                    step="Проектування"
                    user
                />
                <ProjectInfoBlock
                    projectName="Navigator.life - Поиск команды"
                    projectDescript={text.description2}
                    projectType="Стартап"
                    need="Веб-дизайнер, менеджер інтернет проектів, PR менеджер, SEO-фахівець, PHP програміст"
                    authName="Ruslan"
                    step="Пошук команди"
                    user
                />
                <ProjectInfoBlock
                    projectName="Курьерская служба на основе БПЛА"
                    projectDescript={text.description3}
                    projectType="Стартап"
                    need="Інженер, Програміст мобільних додатків, Програміст мікроконтролерів, Інвестор, інженер-електромеханік, інженер-конструктор, Розробник сайту, Програміст"
                    authName="Дмитро Квашнін"
                    step="Пошук команди"
                    user
                />
                <ProjectInfoBlock
                    projectName="Robo lawyer"
                    projectDescript={text.description4}
                    projectType="Проект"
                    need="Back-end індженер"
                    authName="Вячеслав"
                    step="Розробка"
                    user
                />
                <ProjectInfoBlock
                    projectName="Whipcake.com - список задач, мотивирующий действовать"
                    projectDescript={text.description5}
                    projectType="Проект"
                    need="Back-end індженер"
                    authName="Олег Кукушкін"
                    step="Iдея"
                    user
                />
                <ProjectInfoBlock
                    projectName="Watcha"
                    projectDescript={text.description6}
                    projectType="Проект"
                    need="node.js, Дизайнер UI, Маркетолог, JavaScript developer"
                    authName="Павло Акуліч"
                    step="Tестування"
                    user
                />
            </div>
        );
    }
}

export default ProjectList;