import React, {Component} from "react";
import Divider from "material-ui/Divider";

class About extends Component {
    render(){
        return (
          <div className="about">
              <h3>Team Selector - це</h3>
              <p>
                    веб-сервіс, який допомагає знаходити команди для реалізації будь-яких ідей і допомагає знаходити цікаві проекти,
                  в реалізації яких можна взяти участь. Тут немає роботодавців або співробітників, тільки однодумці.
              </p>
              <Divider/>
              <h3>Для людей з безліччю ідей</h3>
              <p>
                    Сервіс дозволить Вам знайти людей, які знають і вміють робити найрізноманітніші речі, Ви можете їх запросити в свою команду і разом
                  реалізовувати цікаві ідеї. Рівень кваліфікації може бути найрізноманітнішим і тільки від Вас залежить, чи зможете Ви домовитися з тим
                  або іншим потенційним учасником і запросити його в команду.
                  Ви створюєте Вашу ідею, перераховуєте напрямки професіоналів, з якими Ви зможете реалізувати ідеї, і шукайте команду.
              </p>
              <Divider/>
              <h3>Пошук проекту</h3>
              <p>
                    Одна з головних задач TeamSelector-a - це вирішувати проблему людей, які хочуть брати участь в різних проектах, стартапах, а коротше
                  людей з конкретною метою. Сервіс дозволяє швидко знаходити такі об'єднання.
              </p>
              <Divider/>
              <p style={{color: '#2c3e50'}}>
                    Варто пам'ятати, що ідея, в реалізації якої Вам цікаво було б брати участь швидше за все знаходиться на стадії
                  ідеї і навряд чи куратор проекту володiє хоть якимсь бюджетом і, відповідно, сплатити Вашу участь в реалізації грошима.
                  Обумовлюйте умови співпраці з Куратором в особистому листуванні, для виключення суперечок надалі.
              </p>
          </div>
        );
    }
}

export default About;